First, use an appropriate SQL query to get a dataset containing the satisfaction_level and last_evaluation of all employees in the sales department who stayed in the company (left = 0). We’ll call this the “Stayed” group. Do a similar SQL query for employees in the sales department who left the company (left = 1). Call this the “Departed” group.

Verify that you have executed this correctly. If you did, you should have 3126 rows in your “Stayed” group, and 1014 in the “Departed” group. Do not proceed until you have completed this correctly.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

pd.options.display.max_rows

from scipy import stats

In [2]:
df = pd.read_csv("HR.csv")

In [3]:
df.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,position,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

### Create two separate dataframes using Sales Dept

In [4]:
df['position'].unique()

array(['sales', 'accounting', 'hr', 'technical', 'support', 'management',
       'IT', 'product_mng', 'marketing', 'RandD'], dtype=object)

In [5]:
dfsales = df[df['position'] == 'sales']

In [6]:
dfsales.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,position,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [7]:
stayed = dfsales[dfsales['left'] == 0]

In [8]:
stayed.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,position,salary
2000,0.58,0.74,4,215,3,0,0,0,sales,low
2001,0.82,0.67,2,202,3,0,0,0,sales,low
2002,0.45,0.69,5,193,3,0,0,0,sales,low
2003,0.78,0.82,5,247,3,0,0,0,sales,low
2004,0.49,0.60,3,214,2,0,0,0,sales,low

In [9]:
stayed = stayed[['satisfaction_level','last_evaluation']]

In [10]:
stayed.head()

      satisfaction_level  last_evaluation
2000                0.58             0.74
2001                0.82             0.67
2002                0.45             0.69
2003                0.78             0.82
2004                0.49             0.60

In [11]:
stayed.shape

(3126, 2)

In [12]:
departed = dfsales[dfsales['left'] == 1]

In [13]:
departed.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,position,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [14]:
departed = departed[['satisfaction_level','last_evaluation']]
departed.head()

   satisfaction_level  last_evaluation
0                0.38             0.53
1                0.80             0.86
2                0.11             0.88
3                0.72             0.87
4                0.37             0.52

In [15]:
departed.shape

(1014, 2)

In [16]:
departed.mean()

satisfaction_level    0.447663
last_evaluation       0.711243
dtype: float64

In [17]:
stayed.mean()

satisfaction_level    0.668548
last_evaluation       0.709223
dtype: float64

What is the p-value for the test in Question 2?

In [18]:
t_statistic, p_value = stats.ttest_1samp(a=departed['satisfaction_level'],popmean=0.47)

In [19]:
print("One sample t-test", p_value)

One sample t-test 0.00602716563964278

Suppose you were looking for evidence that the average last evaluation for the Stayed group was greater than 0.70. Which of the following is the smallest level of significance at which you would conclude that the average last evaluation for the Stayed group is greater than 0.70?

In [20]:
t_statistic, p_value = stats.ttest_1samp(a=stayed['last_evaluation'],popmean=0.70)

In [21]:
print("One sample t-test", p_value)

One sample t-test 0.0014398319118163526